Feat: add architecture diagram in readme
